package sk.com.ymca.java.more_hard_decides.lecture6.classwork.ex1;

/*
Завдання 1: Таблиця множення
Опис:
Напиши програму, яка виводить таблицю множення для чисел від 1 до 10.

Розв'язання:
Використовуй два вкладених цикли for: зовнішній цикл для рядків (чисел від 1 до 10)
 та внутрішній цикл для стовпців (також чисел від 1 до 10).
У внутрішньому циклі обчислюй добуток поточних чисел з зовнішнього та внутрішнього циклів.
Виводь результат у вигляді таблиці.
 */

public class MultiplicationTable {
    public static void main(String[] args) {

        for (int i = 1; i <= 10 ; i++) {
            for (int j = 1; j <= 10; j++) {
                System.out.print(i * j + "\t");
            }
            System.out.println("\n");
        }
    }
}
